export const CivilServantPath = new Map<number, { path: string; min: number; max: number; doc: string }>([
  [1, { path: "基层锻炼", min: 0, max: 0, doc: `你被派到基层锻炼，从田间“小白”逐渐成长为“农村通”，为发展打下基础。` }],
  [2, { path: "任职定级", min: 1, max: 2, doc: `基层锻炼期满，你表现出色、通过考核，正式任职定级，开启科员生涯。` }],
  [3, { path: "乡科级副职", min: 2, max: 4, doc: `你因工作踏实、言行慎重被提拔为乡科级副职，协助基础设施和民生项目建设。` }],
  [4, { path: "乡科级正职", min: 4, max: 6, doc: `你被提拔为乡科级正职，继续推进以往项目，并制定发展规划，经济蒸蒸日上。` }],
  [5, { path: "县处级副职", min: 4, max: 6, doc: `你成绩突出，被提拔为县处级副职，分管义务教育事业，为全县育人出谋划策。` }],
  [6, { path: "县处级正职", min: 6, max: 10, doc: `你推动教育事业取得突破，被提拔为县处级正职，开始正式全面主持县政府工作。` }],
  [7, { path: "厅局级副职", min: 6, max: 10, doc: `你带领全县聚焦新领域、推动攻坚克难，完成GDP翻倍，被提拔为厅局级副职。` }],
  [8, { path: "厅局级正职", min: 6, max: 10, doc: `你政策执行出色、管理有方，升任厅局级正职，推动政策创新，为全省发展掌舵领航。` }]
]);
