export const CounselorPath = new Map<number, { path: string; min: number; max: number; doc: string }>([
  [1, { path: "专职辅导员", min: 0, max: 0, doc: `你入职成为专职辅导员，成为班级的“大家长”，是学生眼中的“知心朋友”。` }],
  [2, { path: "学工/研工组长", min: 2, max: 4, doc: `你晋升学研工组长，开始管理院系学生事务，成为学生工作的“领头羊”。` }],
  [3, { path: "院办公室主任", min: 2, max: 4, doc: `你本研工作做得有条不紊，晋升院办公室主任，协助副书记处理行政事务。` }],
  [4, { path: "挂职轮岗", min: 3, max: 5, doc: `你展现的管理才能被学校发觉，安排你挂职轮岗，在不同岗位上摸爬滚打。` }],
  [5, { path: "院党委副书记", min: 3, max: 5, doc: `挂职归来，你带着“实战经验”，晋升院党委副书记，协助书记分管学生工作。` }],
  [6, { path: "院党委书记", min: 6, max: 10, doc: `你把院系学生事务打理得“门清”，晋升院党委书记，全面主持学院行政工作。` }],
  [7, { path: "校党委副书记", min: 4, max: 8, doc: `在任期学院育人成果丰硕，你被提拔为校党委副书记，站上了更高的平台。` }],
  [8, { path: "校党委书记", min: 8, max: 12, doc: `你不负期待，晋升校党委书记，手握学校的“方向盘”，成为当之无愧的“领航员”。` }]
]);
