export const FreelancePath = new Map<number, { path: string; min: number; max: number; doc: string }>([
  [1, { path: "事业线-灵活就业晋升路径待填充1", min: 0, max: 0, doc: `事业线-灵活就业文案待填充1` }],
  [2, { path: "事业线-灵活就业晋升路径待填充2", min: 2, max: 4, doc: `事业线-灵活就业文案待填充2` }],
  [3, { path: "事业线-灵活就业晋升路径待填充3", min: 2, max: 4, doc: `事业线-灵活就业文案待填充3` }],
  [4, { path: "事业线-灵活就业晋升路径待填充4", min: 2, max: 4, doc: `事业线-灵活就业文案待填充4` }],
  [5, { path: "事业线-灵活就业晋升路径待填充5", min: 3, max: 5, doc: `事业线-灵活就业文案待填充5` }],
  [6, { path: "事业线-灵活就业晋升路径待填充6", min: 4, max: 6, doc: `事业线-灵活就业文案待填充6` }],
  [7, { path: "事业线-灵活就业晋升路径待填充7", min: 6, max: 10, doc: `事业线-灵活就业文案待填充7` }],
  [8, { path: "事业线-灵活就业晋升路径待填充8", min: 8, max: 12, doc: `事业线-灵活就业文案待填充8` }]
]);
