export const YoungResearcherPrePath = new Map<number, { path: string; min: number; max: number; doc: string }>([
  [1, { path: "国家五大科技计划：国家自然科学基金、国家科技重大专项、国家重点研发计划、技术创新引导专项（基金）、基地和人才专项", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充1` }],
  [2, { path: "四小青：优青、青年长江、万人青拔、海外优青", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充2` }],
  [3, { path: "四大青：杰青、长江学者、万人领军、高层次引才计划", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充3` }],
  [4, { path: "两院院士：中科院、工程院院士", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充4` }],
  [5, { path: "事业线-青椒(前置)晋升路径待填充5", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充5` }],
  [6, { path: "事业线-青椒(前置)晋升路径待填充6", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充6` }],
  [7, { path: "事业线-青椒(前置)晋升路径待填充7", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充7` }],
  [8, { path: "事业线-青椒(前置)晋升路径待填充8", min: 1, max: 3, doc: `事业线-青椒(前置)文案待填充8` }]
]);
