export const YoungResearcherPath = new Map<number, { path: string; min: number; max: number; doc: string }>([
  [1, { path: "博士后", min: 0, max: 0, doc: `你在F大博士毕业后选择留在母校做博后，旨在开启学术“卷王”模式。` }],
  [2, { path: "硕导 副教授", min: 2, max: 4, doc: `你晋升副教授兼硕导，开启“带娃”模式，成为学生科研的“指路明灯”。` }],
  [3, { path: "博导 教授", min: 2, max: 4, doc: `你晋升教授，既能带博士生，还拿下了国自然专项，地位蹭蹭上涨。` }],
  [4, { path: "院长助理", min: 3, max: 5, doc: `你被挖去当院长助理，参与学院管理，协助院长打理学院大小事务。` }],
  [5, { path: "副院长", min: 3, max: 5, doc: `你把学院管理得井井有条，晋升副院长，分管科研教学，推动学科建设。` }],
  [6, { path: "院长", min: 5, max: 8, doc: `凭借副院长时期的积累，你成功晋升院长，领导学院发展，制定战略规划。` }],
  [7, { path: "副校长", min: 5, max: 8, doc: `你把学院治理得风生水起，被提拔为副校长，统筹F大教学科研行政工作。` }],
  [8, { path: "校长", min: 5, max: 8, doc: `你一路开挂，成功晋升校长，手握学校“最高权力”，引领学校迈向新的高度。` }]
]);
